Piers-Walter/ESP32-4848S040/src/main.cpp
// TubeStatus — London Underground status board for ESP32-4848S040 (480×480 LVGL)
// Network: TfL Unified API + NTP clock, WiFi credentials persisted in NVS

#include <Arduino.h>
#include <Arduino_GFX_Library.h>
#include <ESP32_4848S040.h>
#include <lvgl.h>
#include "touch.h"
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <time.h>
#ifdef SCREENSHOT_SERVER
#include <WebServer.h>
#endif

// ── Hardware ────────────────────────────────────────────────────────────────
#define GFX_BL         38
#define TFT_HOR_RES    480
#define TFT_VER_RES    480
#define TFT_ROTATION   LV_DISPLAY_ROTATION_90
#define TFT_BRIGHTNESS 255
#define DRAW_BUF_SIZE  (TFT_HOR_RES * TFT_VER_RES / 10 * (LV_COLOR_DEPTH / 8))

static Arduino_ESP32SPI   *bus;
static Arduino_RGB_Display *gfx;
static uint8_t *draw_buf = nullptr;  // PSRAM-allocated in setup()
static lv_display_t *g_disp = nullptr;
static uint8_t g_screen_rotation = 0;  // 0-3 = steps of 90° clockwise from TFT_ROTATION; persisted in NVS

// ── Extra Fonts ──────────────────────────────────────────────────────────────
LV_FONT_DECLARE(lv_font_fa_extra_icons)
#define FA_INFO_ICON "\xEF\x81\x9A"
#define FA_SEARCH_ICON "\xEF\x80\x82"

// ── Line data ────────────────────────────────────────────────────────────────
#define NUM_LINES      20

typedef enum { STATUS_GOOD = 0, STATUS_MINOR, STATUS_SEVERE } StatusLevel;

struct LineInfo {
    const char *id;
    const char *name;
    const char *short_name;
    uint32_t    color;
    bool        text_dark;
};

struct StatusInfo {
    StatusLevel level;
    char        headline[80];
    char        detail[320];
};

struct StatusTone {
    uint32_t bg, fg, dot;
};

static const LineInfo LINES[NUM_LINES] = {
    { "bakerloo",        "Bakerloo",           nullptr,   0xB36305, false },
    { "central",         "Central",            nullptr,   0xE32017, false },
    { "circle",          "Circle",             nullptr,   0xFFD300, true  },
    { "district",        "District",           nullptr,   0x00782A, false },
    { "elizabeth",       "Elizabeth",          nullptr,   0x6950A1, false },
    { "hammersmith-city","Hammersmith & City", "H&C",     0xF3A9BB, true  },
    { "jubilee",         "Jubilee",            nullptr,   0xA0A5A9, true  },
    { "metropolitan",    "Metropolitan",       "Met",     0x9B0056, false },
    { "northern",        "Northern",           nullptr,   0x525860, false },
    { "piccadilly",      "Piccadilly",         nullptr,   0x003688, false },
    { "victoria",        "Victoria",           nullptr,   0x0098D4, false },
    { "waterloo-city",   "Waterloo & City",    "W&C",     0x95CDBA, true  },
    { "dlr",             "DLR",                nullptr,   0x009BBB, false },
    { "lioness",         "Lioness",            nullptr,   0xF882B8, true  },
    { "mildmay",         "Mildmay",            nullptr,   0x0098A4, false },
    { "windrush",        "Windrush",           nullptr,   0xDB261B, false },
    { "weaver",          "Weaver",             nullptr,   0x92298D, false },
    { "suffragette",     "Suffragette",        "Suffrgt", 0x507326, false },
    { "liberty",         "Liberty",            nullptr,   0x751056, false },
    { "tram",            "Tram",               nullptr,   0x84B817, true  },
};

// PSRAM-allocated in setup(); populated by fetch_tfl_status()
static StatusInfo *line_statuses = nullptr;

static const StatusTone STATUS_TONES[3] = {
    { 0x1A1F26, 0xE6E8EB, 0x39B57C }, // good
    { 0x5A3D14, 0xFFE3B0, 0xF2A93B }, // minor
    { 0x6B1721, 0xFFD9DD, 0xFF5168 }, // severe
};

// ── App state ─────────────────────────────────────────────────────────────
static bool     line_enabled[NUM_LINES];
static char     disp_names[NUM_LINES][20];
static uint32_t g_last_fetch_ms   = 0;
static bool     g_ever_fetched    = false;
static char     g_last_fetch_time[6] = "--:--";

// ── Screen/navigation state ───────────────────────────────────────────────
typedef enum { SCREEN_HOME, SCREEN_DETAIL, SCREEN_SETTINGS, SCREEN_SETTINGS_LINES, SCREEN_WIFI_CONFIG, SCREEN_ABOUT } ScreenType;

static ScreenType g_current_screen  = SCREEN_HOME;

// ── Pagination state ──────────────────────────────────────────────────────
static int        g_home_page       = 0;
static int        g_home_page_count = 1;
static int16_t    g_swipe_start_x   = 0;
static bool       g_was_swipe       = false;
static lv_obj_t  *g_tile_cont       = nullptr;
static int16_t    g_cont_start_x    = 0;
static lv_obj_t  *g_page_dots[8]    = {};

// ── UI refs ────────────────────────────────────────────────────────────────
static lv_obj_t *g_time_lbl               = nullptr;
static lv_obj_t *g_wifi_icon_cont         = nullptr;
static lv_obj_t *g_wifi_arcs[3]           = {};
static lv_obj_t *g_toggle_track[NUM_LINES] = {};
static lv_obj_t *g_toggle_knob[NUM_LINES]  = {};

// WiFi config state
static char      g_wifi_ssid[64]     = "";
static char      g_wifi_password[64] = "";
#ifdef SCREENSHOT_SERVER
static WebServer g_screenshot_server(80);
#endif
static lv_obj_t *g_wifi_keyboard     = nullptr;
static lv_obj_t *g_ssid_ta           = nullptr;
static lv_obj_t *g_pwd_ta            = nullptr;
static lv_obj_t *g_wifi_status_lbl   = nullptr;
static bool      g_wifi_was_connected = false;
static lv_obj_t *g_wifi_scan_overlay = nullptr;

// ── Forward declarations ────────────────────────────────────────────────
static void navigate_to(ScreenType type, int line_idx = 0);
static void fetch_tfl_status();

// ── Helpers ────────────────────────────────────────────────────────────────
static inline lv_color_t C(uint32_t rgb) { return lv_color_hex(rgb); }

static const lv_font_t *badge_font(int name_len, bool large) {
    if (large) {
        if (name_len <= 7) return &lv_font_montserrat_22;
        if (name_len <= 9) return &lv_font_montserrat_20;
        return &lv_font_montserrat_18;
    }
    if (name_len <= 7) return &lv_font_montserrat_14;
    if (name_len <= 9) return &lv_font_montserrat_12;
    return &lv_font_montserrat_10;
}

// ── NTP / Clock ───────────────────────────────────────────────────────────
static void configure_ntp() {
    // Europe/London: GMT winter, BST (UTC+1) last Sun Mar → last Sun Oct
    configTzTime("GMT0BST,M3.5.0/1,M10.5.0", "pool.ntp.org", "time.google.com");
    Serial.println("[NTP] Sync requested");
}

static String clock_str() {
    struct tm ti;
    if (getLocalTime(&ti, 0)) {
        char buf[6];
        snprintf(buf, sizeof(buf), "%02d:%02d", ti.tm_hour, ti.tm_min);
        return String(buf);
    }
    // We don't know the time
    return String("--:--");
}

static void updated_str(char *buf, size_t n) {
    if (!g_ever_fetched) {
        snprintf(buf, n, "Updating...");
        return;
    }
    snprintf(buf, n, "Updated %s", g_last_fetch_time);
}

// ── WiFi icon helpers ─────────────────────────────────────────────────────
static int wifi_bars() {
    if (WiFi.status() != WL_CONNECTED) return 0;
    int rssi = WiFi.RSSI();
    if (rssi >= -70) return 3;
    if (rssi >= -80) return 2;
    return 1;
}

static void update_wifi_icon() {
    if (!g_wifi_icon_cont) return;
    int bars = wifi_bars();
    for (int i = 0; i < 3; i++) {
        if (!g_wifi_arcs[i]) continue;
        uint32_t clr = (bars == 0) ? 0x5A2828        // disconnected: dim red
                     : (i < bars)  ? 0xE6E8EB         // active bar: bright
                                   : 0x3A4048;         // inactive bar: dim
        lv_obj_set_style_arc_color(g_wifi_arcs[i], C(clr), LV_PART_INDICATOR);
    }
}

// Three curved arcs (r=5,9,13) fan upward from a common origin at container bottom.
// Arc angles 225°→315° (90° sweep through 270°=top) match the standard WiFi roundel shape.
static void create_wifi_icon(lv_obj_t *parent) {
    g_wifi_icon_cont = nullptr;
    memset(g_wifi_arcs, 0, sizeof(g_wifi_arcs));

    // 26×24 container; arc origin at (13,22). Arcs sweep 225°→315° so all pixels
    // land above y=22 — no overflow, no clipping flag needed.
    lv_obj_t *cont = lv_obj_create(parent);
    lv_obj_set_size(cont, 26, 24);
    lv_obj_align(cont, LV_ALIGN_LEFT_MID, 55, -4);
    lv_obj_set_style_bg_opa(cont, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_width(cont, 0, 0);
    lv_obj_set_style_pad_all(cont, 0, 0);
    lv_obj_remove_flag(cont, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));

