Piers-Walter/ESP32-4848S040/src/main.cpp
    // Origin dot
    lv_obj_t *dot = lv_obj_create(cont);
    lv_obj_set_size(dot, 4, 4);
    lv_obj_set_style_radius(dot, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_bg_color(dot, C(0xE6E8EB), 0);
    lv_obj_set_style_bg_opa(dot, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(dot, 0, 0);
    lv_obj_set_style_pad_all(dot, 0, 0);
    lv_obj_set_pos(dot, 11, 18);   // center at (13,20)
    lv_obj_remove_flag(dot, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));

    static const int radii[3] = { 5, 9, 13 };
    for (int i = 0; i < 3; i++) {
        int r = radii[i];
        lv_obj_t *arc = lv_arc_create(cont);
        lv_obj_set_size(arc, r * 2, r * 2);
        lv_obj_set_pos(arc, 13 - r, 22 - r);   // center arc widget at (13,22)

        lv_arc_set_angles(arc, 225, 315);

        // Hide background ring and knob
        lv_obj_set_style_arc_opa(arc, LV_OPA_TRANSP, LV_PART_MAIN);
        lv_obj_set_style_opa(arc, LV_OPA_TRANSP, LV_PART_KNOB);
        // Indicator style
        lv_obj_set_style_arc_width(arc, 2, LV_PART_INDICATOR);
        lv_obj_set_style_arc_color(arc, C(0xE6E8EB), LV_PART_INDICATOR);
        lv_obj_set_style_arc_rounded(arc, false, LV_PART_INDICATOR);
        // Widget background transparent
        lv_obj_set_style_bg_opa(arc, LV_OPA_TRANSP, 0);
        lv_obj_set_style_border_width(arc, 0, 0);
        lv_obj_set_style_pad_all(arc, 0, 0);
        lv_obj_remove_flag(arc, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));

        g_wifi_arcs[i] = arc;
    }

    g_wifi_icon_cont = cont;
    update_wifi_icon();
}

static void style_screen(lv_obj_t *s) {
    lv_obj_set_size(s, TFT_HOR_RES, TFT_VER_RES);
    lv_obj_set_style_bg_color(s, C(0x0B0E12), 0);
    lv_obj_set_style_bg_opa(s, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(s, 0, 0);
    lv_obj_set_style_pad_all(s, 0, 0);
    lv_obj_remove_flag(s, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE |
                                          LV_OBJ_FLAG_SCROLL_ELASTIC |
                                          LV_OBJ_FLAG_SCROLL_MOMENTUM |
                                          LV_OBJ_FLAG_SCROLL_CHAIN_HOR |
                                          LV_OBJ_FLAG_SCROLL_CHAIN_VER));
}

static void no_decor(lv_obj_t *o) {
    lv_obj_set_style_bg_opa(o, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_width(o, 0, 0);
    lv_obj_set_style_pad_all(o, 0, 0);
    lv_obj_remove_flag(o, (lv_obj_flag_t)((lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE)));
}

// ── Badge widget ─────────────────────────────────────────────────────────
static lv_obj_t *create_badge(lv_obj_t *parent, int idx, int size) {
    const LineInfo &L   = LINES[idx];
    lv_color_t clr      = C(L.color);
    lv_color_t text_clr = L.text_dark ? C(0x0E0F11) : C(0xFFFFFF);

    int stroke   = size * 17 / 100;
    int bar_h    = size * 30 / 100;
    int overhang = size * 11 / 100;
    int cont_w   = size + 2 * overhang;

    lv_obj_t *cont = lv_obj_create(parent);
    lv_obj_set_size(cont, cont_w, size);
    no_decor(cont);

    lv_obj_t *ring = lv_obj_create(cont);
    lv_obj_set_size(ring, size, size);
    lv_obj_align(ring, LV_ALIGN_CENTER, 0, 0);
    lv_obj_set_style_radius(ring, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_bg_opa(ring, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_color(ring, clr, 0);
    lv_obj_set_style_border_width(ring, stroke, 0);
    lv_obj_set_style_border_opa(ring, LV_OPA_COVER, 0);
    lv_obj_set_style_pad_all(ring, 0, 0);
    lv_obj_remove_flag(ring, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));

    lv_obj_t *bar = lv_obj_create(cont);
    lv_obj_set_size(bar, cont_w, bar_h);
    lv_obj_align(bar, LV_ALIGN_CENTER, 0, 0);
    lv_obj_set_style_bg_color(bar, clr, 0);
    lv_obj_set_style_bg_opa(bar, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(bar, 0, 0);
    lv_obj_set_style_radius(bar, 0, 0);
    lv_obj_set_style_pad_all(bar, 0, 0);
    lv_obj_remove_flag(bar, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));

    lv_obj_t *lbl = lv_label_create(bar);
    lv_label_set_text(lbl, disp_names[idx]);
    lv_obj_set_style_text_color(lbl, text_clr, 0);
    lv_obj_set_style_text_font(lbl, badge_font((int)strlen(disp_names[idx]), size >= 100), 0);
    lv_obj_set_style_text_letter_space(lbl, 1, 0);
    lv_obj_align(lbl, LV_ALIGN_CENTER, 0, 0);
    lv_obj_remove_flag(lbl, LV_OBJ_FLAG_CLICKABLE);

    return cont;
}

// ── Shared header builder ─────────────────────────────────────────────────
static lv_obj_t *build_header(lv_obj_t *scr) {
    lv_obj_t *hdr = lv_obj_create(scr);
    lv_obj_set_size(hdr, TFT_HOR_RES, 56);
    lv_obj_set_pos(hdr, 0, 0);
    lv_obj_set_style_bg_color(hdr, C(0x0B0E12), 0);
    lv_obj_set_style_bg_opa(hdr, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(hdr, 1, 0);
    lv_obj_set_style_border_side(hdr, LV_BORDER_SIDE_BOTTOM, 0);
    lv_obj_set_style_border_color(hdr, C(0x1A1F26), 0);
    lv_obj_set_style_border_opa(hdr, LV_OPA_COVER, 0);
    lv_obj_set_style_pad_hor(hdr, 16, 0);
    lv_obj_set_style_pad_ver(hdr, 0, 0);
    lv_obj_remove_flag(hdr, LV_OBJ_FLAG_SCROLLABLE);
    return hdr;
}

static lv_obj_t *build_back_btn(lv_obj_t *hdr) {
    lv_obj_t *btn = lv_button_create(hdr);
    lv_obj_set_size(btn, 32, 32);
    lv_obj_align(btn, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_style_bg_color(btn, C(0x1A1F26), 0);
    lv_obj_set_style_bg_opa(btn, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(btn, 0, 0);
    lv_obj_set_style_radius(btn, 8, 0);
    lv_obj_set_style_pad_all(btn, 0, 0);
    lv_obj_set_ext_click_area(btn, 24);
    lv_obj_t *ico = lv_label_create(btn);
    lv_label_set_text(ico, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_color(ico, C(0xE6E8EB), 0);
    lv_obj_align(ico, LV_ALIGN_CENTER, 0, 0);
    return btn;
}

// ── Home screen ────────────────────────────────────────────────────────────
static void tile_cb(lv_event_t *e) {
    if (g_was_swipe) return;
    navigate_to(SCREEN_DETAIL, (int)(uintptr_t)lv_event_get_user_data(e));
}

static void home_swipe_pressed_cb(lv_event_t *) {
    lv_point_t p;
    lv_indev_get_point(lv_indev_active(), &p);
    g_swipe_start_x = p.x;
    g_was_swipe = false;
    if (g_tile_cont) {
        lv_anim_delete(g_tile_cont, nullptr);
        g_cont_start_x = (int16_t)lv_obj_get_x(g_tile_cont);
    }
}

