Piers-Walter/ESP32-4848S040/src/main.cpp
static void home_swipe_pressing_cb(lv_event_t *) {
    if (!g_tile_cont) return;
    lv_point_t p;
    lv_indev_get_point(lv_indev_active(), &p);
    int dx   = (int)p.x - g_swipe_start_x;
    int nx   = (int)g_cont_start_x + dx;
    int minx = -(g_home_page_count - 1) * TFT_HOR_RES;
    if (nx > 0)    nx = nx / 3;
    if (nx < minx) nx = minx + (nx - minx) / 3;
    lv_obj_set_x(g_tile_cont, nx);
    if (dx > 10 || dx < -10) g_was_swipe = true;
}

static void home_swipe_released_cb(lv_event_t *) {
    if (!g_tile_cont) return;
    lv_point_t p;
    lv_indev_get_point(lv_indev_active(), &p);
    int dx = (int)p.x - g_swipe_start_x;
    if (dx < -40 && g_home_page < g_home_page_count - 1) {
        g_home_page++;
        g_was_swipe = true;
    } else if (dx > 40 && g_home_page > 0) {
        g_home_page--;
        g_was_swipe = true;
    }
    for (int i = 0; i < g_home_page_count && i < 8; i++) {
        if (g_page_dots[i])
            lv_obj_set_style_bg_color(g_page_dots[i],
                i == g_home_page ? C(0xE6E8EB) : C(0x3A4048), 0);
    }
    int target_x = -g_home_page * TFT_HOR_RES;
    lv_anim_t a;
    lv_anim_init(&a);
    lv_anim_set_var(&a, g_tile_cont);
    lv_anim_set_exec_cb(&a, [](void *obj, int32_t v) {
        lv_obj_set_x((lv_obj_t *)obj, v);
    });
    lv_anim_set_values(&a, lv_obj_get_x(g_tile_cont), target_x);
    lv_anim_set_duration(&a, 250);
    lv_anim_set_path_cb(&a, lv_anim_path_ease_out);
    lv_anim_start(&a);
}

static void build_home(lv_obj_t *scr) {
    g_time_lbl = nullptr;

    int all_sorted[NUM_LINES], total = 0;
    for (int pass = 2; pass >= 0; pass--) {
        for (int i = 0; i < NUM_LINES; i++) {
            if (line_enabled[i] && (int)line_statuses[i].level == pass)
                all_sorted[total++] = i;
        }
    }

    int cols, rows, badge_size;
    if      (total <= 1) { cols = 1; rows = 1; badge_size = 160; }
    else if (total <= 2) { cols = 1; rows = 2; badge_size = 120; }
    else if (total <= 4) { cols = 2; rows = 2; badge_size = 120; }
    else if (total <= 6) { cols = 3; rows = 2; badge_size = 100; }
    else if (total <= 9) { cols = 3; rows = 3; badge_size =  80; }
    else                 { cols = 4; rows = 3; badge_size =  70; }
    int lines_per_page = cols * rows;

    g_home_page_count = (total + lines_per_page - 1) / lines_per_page;
    if (g_home_page_count < 1) g_home_page_count = 1;
    if (g_home_page >= g_home_page_count) g_home_page = g_home_page_count - 1;

    lv_obj_t *hdr = build_header(scr);

    g_time_lbl = lv_label_create(hdr);
    lv_label_set_text(g_time_lbl, clock_str().c_str());
    lv_obj_set_style_text_color(g_time_lbl, C(0xE6E8EB), 0);
    lv_obj_set_style_text_font(g_time_lbl, &lv_font_montserrat_20, 0);
    lv_obj_align(g_time_lbl, LV_ALIGN_LEFT_MID, 0, 0);

    create_wifi_icon(hdr);

    char upd[28];
    updated_str(upd, sizeof(upd));
    lv_obj_t *upd_lbl = lv_label_create(hdr);
    lv_label_set_text(upd_lbl, upd);
    lv_obj_set_style_text_color(upd_lbl, C(0x6E7681), 0);
    lv_obj_set_style_text_font(upd_lbl, &lv_font_montserrat_10, 0);
    lv_obj_align(upd_lbl, LV_ALIGN_RIGHT_MID, -42, 0);

    lv_obj_t *sbtn = lv_button_create(hdr);
    lv_obj_set_size(sbtn, 32, 32);
    lv_obj_align(sbtn, LV_ALIGN_RIGHT_MID, 0, 0);
    lv_obj_set_style_bg_color(sbtn, C(0x1A1F26), 0);
    lv_obj_set_style_bg_opa(sbtn, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(sbtn, 0, 0);
    lv_obj_set_style_radius(sbtn, 8, 0);
    lv_obj_set_style_pad_all(sbtn, 0, 0);
    lv_obj_add_event_cb(sbtn, [](lv_event_t *) { navigate_to(SCREEN_SETTINGS); }, LV_EVENT_CLICKED, nullptr);
    lv_obj_t *sico = lv_label_create(sbtn);
    lv_label_set_text(sico, LV_SYMBOL_SETTINGS);
    lv_obj_set_style_text_color(sico, C(0x9AA3AD), 0);
    lv_obj_align(sico, LV_ALIGN_CENTER, 0, 0);

    if (strlen(g_wifi_ssid) == 0) {
        lv_obj_t *card = lv_obj_create(scr);
        lv_obj_set_size(card, 360, 240);
        lv_obj_align(card, LV_ALIGN_CENTER, 0, 16);
        lv_obj_set_style_bg_color(card, C(0x141820), 0);
        lv_obj_set_style_bg_opa(card, LV_OPA_COVER, 0);
        lv_obj_set_style_border_color(card, C(0x2A3040), 0);
        lv_obj_set_style_border_width(card, 1, 0);
        lv_obj_set_style_border_opa(card, LV_OPA_COVER, 0);
        lv_obj_set_style_radius(card, 16, 0);
        lv_obj_set_style_pad_all(card, 24, 0);
        lv_obj_remove_flag(card, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));
        lv_obj_set_flex_flow(card, LV_FLEX_FLOW_COLUMN);
        lv_obj_set_flex_align(card, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);
        lv_obj_set_style_pad_row(card, 16, 0);

        lv_obj_t *icon_lbl = lv_label_create(card);
        lv_label_set_text(icon_lbl, LV_SYMBOL_WIFI);
        lv_obj_set_style_text_color(icon_lbl, C(0x5A6470), 0);
        lv_obj_set_style_text_font(icon_lbl, &lv_font_montserrat_48, 0);

        lv_obj_t *title = lv_label_create(card);
        lv_label_set_text(title, "No Wi-Fi configured");
        lv_obj_set_style_text_color(title, C(0xE6E8EB), 0);
        lv_obj_set_style_text_font(title, &lv_font_montserrat_16, 0);

        lv_obj_t *sub = lv_label_create(card);
        lv_label_set_text(sub, "Connect to fetch live tube status");
        lv_obj_set_style_text_color(sub, C(0x6E7681), 0);
        lv_obj_set_style_text_font(sub, &lv_font_montserrat_12, 0);

        lv_obj_t *btn = lv_button_create(card);
        lv_obj_set_size(btn, 280, 52);
        lv_obj_set_style_bg_color(btn, C(0x1A6FD4), 0);
        lv_obj_set_style_bg_opa(btn, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(btn, 0, 0);
        lv_obj_set_style_radius(btn, 12, 0);
        lv_obj_set_style_pad_all(btn, 0, 0);
        lv_obj_add_event_cb(btn, [](lv_event_t *) { navigate_to(SCREEN_WIFI_CONFIG); }, LV_EVENT_CLICKED, nullptr);
        lv_obj_t *btn_lbl = lv_label_create(btn);
        lv_label_set_text(btn_lbl, "Set up Wi-Fi");
        lv_obj_set_style_text_color(btn_lbl, C(0xFFFFFF), 0);
        lv_obj_set_style_text_font(btn_lbl, &lv_font_montserrat_16, 0);
        lv_obj_align(btn_lbl, LV_ALIGN_CENTER, 0, 0);
        return;
    }

    if (total == 0) {
        lv_obj_t *empty = lv_label_create(scr);
        lv_label_set_text(empty, "No lines selected.\nTap " LV_SYMBOL_SETTINGS " to configure.");
        lv_obj_set_style_text_color(empty, C(0x6E7681), 0);
        lv_obj_set_style_text_font(empty, &lv_font_montserrat_14, 0);
        lv_obj_set_style_text_align(empty, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(empty, LV_ALIGN_CENTER, 0, 0);
        return;
    }

    int pad    = 12, gap = 8;
    int grid_w = TFT_HOR_RES - 2 * pad;
    int grid_h = TFT_VER_RES - 56 - 2 * pad - 24;
    int tile_w = (grid_w - (cols - 1) * gap) / cols;
    int tile_h = (grid_h - (rows - 1) * gap) / rows;
    int badge_cont_w = badge_size + 2 * (badge_size * 11 / 100);

    g_tile_cont = lv_obj_create(scr);
    lv_obj_set_size(g_tile_cont, g_home_page_count * TFT_HOR_RES, TFT_VER_RES - 56);
    lv_obj_set_pos(g_tile_cont, -g_home_page * TFT_HOR_RES, 56);
    no_decor(g_tile_cont);

