Piers-Walter/ESP32-4848S040/src/main.cpp
    for (int pg = 0; pg < g_home_page_count; pg++) {
        int ps = pg * lines_per_page;
        int pe = ps + lines_per_page;
        if (pe > total) pe = total;
        for (int t = 0; t < pe - ps; t++) {
            int idx                = all_sorted[ps + t];
            const StatusInfo &st   = line_statuses[idx];
            const StatusTone &tone = STATUS_TONES[(int)st.level];
            int col = t % cols;
            int row = t / cols;
            int tx  = pg * TFT_HOR_RES + pad + col * (tile_w + gap);
            int ty  = pad + row * (tile_h + gap);

            lv_obj_t *tile = lv_button_create(g_tile_cont);
            lv_obj_set_size(tile, tile_w, tile_h);
            lv_obj_set_pos(tile, tx, ty);
            lv_obj_set_style_bg_color(tile, C(tone.bg), 0);
            lv_obj_set_style_bg_opa(tile, LV_OPA_COVER, 0);
            lv_obj_set_style_border_width(tile, 0, 0);
            lv_obj_set_style_radius(tile, 10, 0);
            lv_obj_set_style_pad_all(tile, 0, 0);
            lv_obj_remove_flag(tile, LV_OBJ_FLAG_SCROLLABLE);
            lv_obj_add_event_cb(tile, home_swipe_pressed_cb,  LV_EVENT_PRESSED,  nullptr);
            lv_obj_add_event_cb(tile, home_swipe_pressing_cb, LV_EVENT_PRESSING, nullptr);
            lv_obj_add_event_cb(tile, home_swipe_released_cb, LV_EVENT_RELEASED, nullptr);
            lv_obj_add_event_cb(tile, tile_cb, LV_EVENT_CLICKED, (void *)(uintptr_t)idx);

            bool has_status_text = (st.level != STATUS_GOOD);
            int text_reserve = has_status_text ? 26 : 14;
            int badge_top    = (tile_h - text_reserve) / 2 - badge_size / 2;
            if (badge_top < 6) badge_top = 6;

            lv_obj_t *badge = create_badge(tile, idx, badge_size);
            lv_obj_set_pos(badge, (tile_w - badge_cont_w) / 2, badge_top);

            if (has_status_text) {
                lv_obj_t *stlbl = lv_label_create(tile);
                lv_label_set_text(stlbl, st.headline);
                lv_obj_set_style_text_color(stlbl, C(tone.fg), 0);
                lv_obj_set_style_text_font(stlbl, &lv_font_montserrat_10, 0);
                lv_obj_align(stlbl, LV_ALIGN_BOTTOM_MID, 0, -8);
            }
        }
    }

    lv_obj_add_event_cb(scr, home_swipe_pressed_cb,  LV_EVENT_PRESSED,  nullptr);
    lv_obj_add_event_cb(scr, home_swipe_pressing_cb, LV_EVENT_PRESSING, nullptr);
    lv_obj_add_event_cb(scr, home_swipe_released_cb, LV_EVENT_RELEASED, nullptr);

    memset(g_page_dots, 0, sizeof(g_page_dots));
    if (g_home_page_count > 1) {
        static const int DOT_D = 7, DOT_GAP = 6;
        int dots_w = g_home_page_count * DOT_D + (g_home_page_count - 1) * DOT_GAP;
        int dot_x0 = (TFT_HOR_RES - dots_w) / 2;
        int dot_y  = TFT_VER_RES - 14;
        for (int p = 0; p < g_home_page_count && p < 8; p++) {
            lv_obj_t *dot = lv_obj_create(scr);
            lv_obj_set_size(dot, DOT_D, DOT_D);
            lv_obj_set_pos(dot, dot_x0 + p * (DOT_D + DOT_GAP), dot_y);
            lv_obj_set_style_radius(dot, LV_RADIUS_CIRCLE, 0);
            lv_obj_set_style_bg_color(dot, p == g_home_page ? C(0xE6E8EB) : C(0x3A4048), 0);
            lv_obj_set_style_bg_opa(dot, LV_OPA_COVER, 0);
            lv_obj_set_style_border_width(dot, 0, 0);
            lv_obj_remove_flag(dot, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));
            g_page_dots[p] = dot;
        }
    }
}

// ── Detail screen ─────────────────────────────────────────────────────────
static void back_to_home(lv_event_t *)     { navigate_to(SCREEN_HOME); }
static void back_to_settings(lv_event_t *) { navigate_to(SCREEN_SETTINGS); }

static void build_detail(lv_obj_t *scr, int idx) {
    const LineInfo   &L    = LINES[idx];
    const StatusInfo &st   = line_statuses[idx];
    const StatusTone &tone = STATUS_TONES[(int)st.level];

    lv_obj_t *hdr  = build_header(scr);
    lv_obj_t *bbtn = build_back_btn(hdr);
    lv_obj_add_event_cb(bbtn, back_to_home, LV_EVENT_CLICKED, nullptr);

    char title[64];
    snprintf(title, sizeof(title), "%s line", L.name);
    lv_obj_t *tlbl = lv_label_create(hdr);
    lv_label_set_text(tlbl, title);
    lv_obj_set_style_text_color(tlbl, C(0xE6E8EB), 0);
    lv_obj_set_style_text_font(tlbl, &lv_font_montserrat_16, 0);
    lv_obj_align(tlbl, LV_ALIGN_LEFT_MID, 44, 0);

    static const int BADGE_SIZE = 140;
    int badge_cont_w = BADGE_SIZE + 2 * (BADGE_SIZE * 11 / 100);
    int content_y    = 76;

    lv_obj_t *badge = create_badge(scr, idx, BADGE_SIZE);
    lv_obj_set_pos(badge, (TFT_HOR_RES - badge_cont_w) / 2, content_y);
    content_y += BADGE_SIZE + 18;

    lv_obj_t *pill = lv_obj_create(scr);
    lv_obj_set_height(pill, 30);
    lv_obj_set_width(pill, LV_SIZE_CONTENT);
    lv_obj_set_style_bg_color(pill, C(tone.bg), 0);
    lv_obj_set_style_bg_opa(pill, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(pill, 0, 0);
    lv_obj_set_style_radius(pill, 15, 0);
    lv_obj_set_style_pad_hor(pill, 14, 0);
    lv_obj_set_style_pad_ver(pill, 0, 0);
    lv_obj_set_style_pad_column(pill, 8, 0);
    lv_obj_remove_flag(pill, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));
    lv_obj_set_flex_flow(pill, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(pill, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    lv_obj_t *dot = lv_obj_create(pill);
    lv_obj_set_size(dot, 8, 8);
    lv_obj_set_style_radius(dot, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_bg_color(dot, C(tone.dot), 0);
    lv_obj_set_style_bg_opa(dot, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(dot, 0, 0);
    lv_obj_remove_flag(dot, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));

    lv_obj_t *plbl = lv_label_create(pill);
    lv_label_set_text(plbl, st.headline);
    lv_obj_set_style_text_color(plbl, C(tone.fg), 0);
    lv_obj_set_style_text_font(plbl, &lv_font_montserrat_14, 0);
    lv_obj_remove_flag(plbl, LV_OBJ_FLAG_CLICKABLE);

    lv_obj_update_layout(pill);
    lv_obj_align(pill, LV_ALIGN_TOP_MID, 0, content_y);
    content_y += 42;

    lv_obj_t *detail = lv_label_create(scr);
    lv_label_set_text(detail, st.detail);
    lv_label_set_long_mode(detail, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(detail, 440);
    lv_obj_set_style_text_color(detail, C(0xC6CBD2), 0);
    lv_obj_set_style_text_font(detail, &lv_font_montserrat_14, 0);
    lv_obj_set_style_text_align(detail, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(detail, LV_ALIGN_TOP_MID, 0, content_y);

    char upd[32];
    updated_str(upd, sizeof(upd));
    lv_obj_t *ulbl = lv_label_create(scr);
    lv_label_set_text(ulbl, upd);
    lv_obj_set_style_text_color(ulbl, C(0x6E7681), 0);
    lv_obj_set_style_text_font(ulbl, &lv_font_montserrat_10, 0);
    lv_obj_align(ulbl, LV_ALIGN_BOTTOM_MID, 0, -16);
}

