Piers-Walter/ESP32-4848S040/src/main.cpp
// ── Settings screen ───────────────────────────────────────────────────────
static void save_line_prefs();  // forward declaration

static void refresh_toggle(int i) {
    bool on = line_enabled[i];
    if (g_toggle_track[i])
        lv_obj_set_style_bg_color(g_toggle_track[i], on ? C(0x39B57C) : C(0x2A3038), 0);
    if (g_toggle_knob[i])
        lv_obj_align(g_toggle_knob[i], LV_ALIGN_LEFT_MID, on ? 16 : 2, 0);
}

static void settings_row_cb(lv_event_t *e) {
    int i = (int)(uintptr_t)lv_event_get_user_data(e);
    line_enabled[i] = !line_enabled[i];
    refresh_toggle(i);
    save_line_prefs();
}

static void settings_all_cb(lv_event_t *) {
    for (int i = 0; i < NUM_LINES; i++) { line_enabled[i] = true;  refresh_toggle(i); }
    save_line_prefs();
}

static void settings_none_cb(lv_event_t *) {
    for (int i = 0; i < NUM_LINES; i++) { line_enabled[i] = false; refresh_toggle(i); }
    save_line_prefs();
}

static void build_settings_lines(lv_obj_t *scr) {
    for (int i = 0; i < NUM_LINES; i++) g_toggle_track[i] = g_toggle_knob[i] = nullptr;

    lv_obj_t *hdr  = build_header(scr);
    lv_obj_t *bbtn = build_back_btn(hdr);
    lv_obj_add_event_cb(bbtn, back_to_settings, LV_EVENT_CLICKED, nullptr);

    lv_obj_t *tlbl = lv_label_create(hdr);
    lv_label_set_text(tlbl, "Lines");
    lv_obj_set_style_text_color(tlbl, C(0xE6E8EB), 0);
    lv_obj_set_style_text_font(tlbl, &lv_font_montserrat_16, 0);
    lv_obj_align(tlbl, LV_ALIGN_LEFT_MID, 44, 0);

    lv_obj_t *sub = lv_obj_create(scr);
    lv_obj_set_size(sub, TFT_HOR_RES, 40);
    lv_obj_set_pos(sub, 0, 56);
    lv_obj_set_style_bg_color(sub, C(0x0B0E12), 0);
    lv_obj_set_style_bg_opa(sub, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(sub, 0, 0);
    lv_obj_set_style_pad_hor(sub, 12, 0);
    lv_obj_set_style_pad_ver(sub, 0, 0);
    lv_obj_remove_flag(sub, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *show_lbl = lv_label_create(sub);
    lv_label_set_text(show_lbl, "SHOW ON DASHBOARD");
    lv_obj_set_style_text_color(show_lbl, C(0x6E7681), 0);
    lv_obj_set_style_text_font(show_lbl, &lv_font_montserrat_10, 0);
    lv_obj_align(show_lbl, LV_ALIGN_LEFT_MID, 0, 0);

    struct { const char *txt; lv_event_cb_t cb; int w; } chips[] = {
        { "NONE", settings_none_cb, 50 },
        { "ALL",  settings_all_cb,  38 },
    };
    int chip_x = -0;
    for (int c = 0; c < 2; c++) {
        lv_obj_t *chip = lv_button_create(sub);
        lv_obj_set_size(chip, chips[c].w, 24);
        lv_obj_align(chip, LV_ALIGN_RIGHT_MID, chip_x, 0);
        chip_x -= chips[c].w + 16;
        lv_obj_set_style_bg_color(chip, C(0x1A1F26), 0);
        lv_obj_set_style_bg_opa(chip, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(chip, 0, 0);
        lv_obj_set_style_radius(chip, 7, 0);
        lv_obj_set_style_pad_all(chip, 0, 0);
        lv_obj_set_ext_click_area(chip, 16);
        lv_obj_add_event_cb(chip, chips[c].cb, LV_EVENT_CLICKED, nullptr);
        lv_obj_t *clbl = lv_label_create(chip);
        lv_label_set_text(clbl, chips[c].txt);
        lv_obj_set_style_text_color(clbl, C(0x9AA3AD), 0);
        lv_obj_set_style_text_font(clbl, &lv_font_montserrat_10, 0);
        lv_obj_align(clbl, LV_ALIGN_CENTER, 0, 0);
    }

    lv_obj_t *list = lv_obj_create(scr);
    lv_obj_set_pos(list, 0, 96);
    lv_obj_set_size(list, TFT_HOR_RES, TFT_VER_RES - 96);
    lv_obj_set_style_bg_color(list, C(0x0B0E12), 0);
    lv_obj_set_style_bg_opa(list, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(list, 0, 0);
    lv_obj_set_style_pad_all(list, 0, 0);
    lv_obj_set_scrollbar_mode(list, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(list, LV_DIR_VER);
    lv_obj_add_flag(list, LV_OBJ_FLAG_SCROLLABLE);

    static const int ROW_H = 54, ROW_GAP = 4;

    for (int i = 0; i < NUM_LINES; i++) {
        const LineInfo   &L    = LINES[i];
        const StatusInfo &st   = line_statuses[i];
        const StatusTone &tone = STATUS_TONES[(int)st.level];
        bool on = line_enabled[i];

        lv_obj_t *row = lv_button_create(list);
        lv_obj_set_size(row, TFT_HOR_RES - 24, ROW_H);
        lv_obj_set_pos(row, 12, i * (ROW_H + ROW_GAP) + 4);
        lv_obj_set_style_bg_color(row, C(0x14181E), 0);
        lv_obj_set_style_bg_opa(row, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(row, 0, 0);
        lv_obj_set_style_radius(row, 10, 0);
        lv_obj_set_style_pad_all(row, 0, 0);
        lv_obj_remove_flag(row, LV_OBJ_FLAG_SCROLLABLE);
        lv_obj_add_event_cb(row, settings_row_cb, LV_EVENT_CLICKED, (void *)(uintptr_t)i);

        lv_obj_t *dot = lv_obj_create(row);
        lv_obj_set_size(dot, 28, 28);
        lv_obj_set_pos(dot, 12, (ROW_H - 28) / 2);
        lv_obj_set_style_radius(dot, LV_RADIUS_CIRCLE, 0);
        lv_obj_set_style_bg_color(dot, C(L.color), 0);
        lv_obj_set_style_bg_opa(dot, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(dot, 0, 0);
        lv_obj_set_style_pad_all(dot, 0, 0);
        lv_obj_remove_flag(dot, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));

        lv_obj_t *nlbl = lv_label_create(row);
        lv_label_set_text(nlbl, L.name);
        lv_obj_set_style_text_color(nlbl, C(0xE6E8EB), 0);
        lv_obj_set_style_text_font(nlbl, &lv_font_montserrat_14, 0);
        lv_obj_set_pos(nlbl, 52, 10);
        lv_obj_remove_flag(nlbl, LV_OBJ_FLAG_CLICKABLE);

        lv_obj_t *slbl = lv_label_create(row);
        lv_label_set_text(slbl, st.headline);
        lv_obj_set_style_text_color(slbl, C(tone.dot), 0);
        lv_obj_set_style_text_font(slbl, &lv_font_montserrat_12, 0);
        lv_obj_set_pos(slbl, 52, 30);
        lv_obj_remove_flag(slbl, LV_OBJ_FLAG_CLICKABLE);

        lv_obj_t *track = lv_obj_create(row);
        lv_obj_set_size(track, 36, 22);
        lv_obj_set_pos(track, (TFT_HOR_RES - 24) - 36 - 12, (ROW_H - 22) / 2);
        lv_obj_set_style_radius(track, 11, 0);
        lv_obj_set_style_bg_color(track, on ? C(0x39B57C) : C(0x2A3038), 0);
        lv_obj_set_style_bg_opa(track, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(track, 0, 0);
        lv_obj_set_style_pad_all(track, 0, 0);
        lv_obj_remove_flag(track, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));
        g_toggle_track[i] = track;

        lv_obj_t *knob = lv_obj_create(track);
        lv_obj_set_size(knob, 18, 18);
        lv_obj_set_style_radius(knob, LV_RADIUS_CIRCLE, 0);
        lv_obj_set_style_bg_color(knob, C(0xFFFFFF), 0);
        lv_obj_set_style_bg_opa(knob, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(knob, 0, 0);
        lv_obj_set_style_pad_all(knob, 0, 0);
        lv_obj_remove_flag(knob, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));
        lv_obj_align(knob, LV_ALIGN_LEFT_MID, on ? 16 : 2, 0);
        g_toggle_knob[i] = knob;
    }
}

// ── Preferences helpers ───────────────────────────────────────────────
static void save_line_prefs() {
    Preferences prefs;
    prefs.begin("lines", false);
    uint32_t mask = 0;
    for (int i = 0; i < NUM_LINES; i++)
        if (line_enabled[i]) mask |= (1u << i);
    prefs.putUInt("mask", mask);
    prefs.end();
}

static void load_line_prefs() {
    Preferences prefs;
    prefs.begin("lines", true);
    if (!prefs.isKey("mask")) { prefs.end(); return; }
    uint32_t mask = prefs.getUInt("mask", 0xFFFFFFFF);
    prefs.end();
    for (int i = 0; i < NUM_LINES; i++)
        line_enabled[i] = (mask >> i) & 1;
}

