Piers-Walter/ESP32-4848S040/src/main.cpp
// ── Screen rotation ─────────────────────────────────────────────────────
// Index 0 is the factory default orientation (gfx rotation 3 / TFT_ROTATION).
// Each increment rotates 90° further clockwise.
//
// lv_conf.h has LV_DRAW_TRANSFORM_USE_MATRIX / LV_USE_MATRIX disabled, so
// LVGL's own render pipeline never rotates pixel content — lv_display_set_rotation()
// only affects touch-point remapping (lv_display_rotate_point(), called
// unconditionally from LVGL's indev handling) and the hor/ver-res getters.
// The actual on-screen rotation comes entirely from gfx->setRotation(), which
// re-maps each flushed bitmap into the physical framebuffer (see
// Arduino_RGB_Display::draw16bitRGBBitmap). Confirmed on hardware: gfx's
// rotation index and LVGL's touch-remap rotation step in opposite directions,
// so as gfx steps clockwise (index+1), the touch remap must step the other
// way (index-1) to keep landing on the same visual position.
static const uint8_t GFX_ROTATION_BASE = 3;
static const lv_display_rotation_t SCREEN_ROTATIONS[4] = {
    LV_DISPLAY_ROTATION_90, LV_DISPLAY_ROTATION_0, LV_DISPLAY_ROTATION_270, LV_DISPLAY_ROTATION_180,
};
static const char *const SCREEN_ROTATION_LABELS[4] = { "0°", "90°", "180°", "270°" };

static void apply_screen_rotation(uint8_t idx) {
    g_screen_rotation = idx & 3;
    gfx->setRotation((GFX_ROTATION_BASE + g_screen_rotation) % 4);
    lv_display_set_rotation(g_disp, SCREEN_ROTATIONS[g_screen_rotation]);
    lv_obj_t *scr = lv_screen_active();
    if (scr) lv_obj_invalidate(scr);
}

static void save_screen_rotation() {
    Preferences prefs;
    prefs.begin("display", false);
    prefs.putUChar("rot", g_screen_rotation);
    prefs.end();
}

static void load_screen_rotation() {
    Preferences prefs;
    prefs.begin("display", true);
    g_screen_rotation = prefs.getUChar("rot", 0) & 3;
    prefs.end();
}

static void load_wifi_credentials() {
    Preferences prefs;
    prefs.begin("wifi", true);
    String ssid = prefs.getString("ssid", "");
    String pass = prefs.getString("password", "");
    prefs.end();
    strncpy(g_wifi_ssid,     ssid.c_str(), 63);
    strncpy(g_wifi_password, pass.c_str(), 63);
    g_wifi_ssid[63] = g_wifi_password[63] = '\0';
    Serial.printf("[WiFi] Loaded from NVS: ssid='%s' pass_len=%d\n", g_wifi_ssid, (int)strlen(g_wifi_password));
}

static const char *wifi_status_str(wl_status_t s) {
    switch (s) {
        case WL_IDLE_STATUS:      return "IDLE";
        case WL_NO_SSID_AVAIL:    return "NO_SSID_AVAIL";
        case WL_SCAN_COMPLETED:   return "SCAN_COMPLETED";
        case WL_CONNECTED:        return "CONNECTED";
        case WL_CONNECT_FAILED:   return "CONNECT_FAILED";
        case WL_CONNECTION_LOST:  return "CONNECTION_LOST";
        case WL_DISCONNECTED:     return "DISCONNECTED";
        default:                  return "UNKNOWN";
    }
}

static void wifi_connect_and_save() {
    if (g_ssid_ta) strncpy(g_wifi_ssid,     lv_textarea_get_text(g_ssid_ta), 63);
    if (g_pwd_ta)  strncpy(g_wifi_password,  lv_textarea_get_text(g_pwd_ta),  63);
    g_wifi_ssid[63] = g_wifi_password[63] = '\0';

    Serial.printf("[WiFi] SSID='%s' pass_len=%d\n", g_wifi_ssid, (int)strlen(g_wifi_password));

    if (g_wifi_keyboard) lv_obj_add_flag(g_wifi_keyboard, LV_OBJ_FLAG_HIDDEN);

    if (strlen(g_wifi_ssid) == 0) {
        if (g_wifi_status_lbl) lv_label_set_text(g_wifi_status_lbl, "Enter an SSID first");
        return;
    }

    if (g_wifi_status_lbl) lv_label_set_text(g_wifi_status_lbl, "Connecting...");
    lv_timer_handler();

    WiFi.disconnect(false);
    delay(100);
    WiFi.begin(g_wifi_ssid, g_wifi_password);

    uint32_t start = millis();
    wl_status_t last_status = WL_IDLE_STATUS;
    while (WiFi.status() != WL_CONNECTED && millis() - start < 15000) {
        wl_status_t cur = WiFi.status();
        if (cur != last_status) {
            Serial.printf("[WiFi] status: %s (+%lums)\n", wifi_status_str(cur), millis() - start);
            last_status = cur;
        }
        lv_timer_handler();
        delay(50);
    }

    wl_status_t final_status = WiFi.status();
    Serial.printf("[WiFi] done after %lums, status=%s\n", millis() - start, wifi_status_str(final_status));

    if (final_status == WL_CONNECTED) {
        Serial.printf("[WiFi] IP=%s\n", WiFi.localIP().toString().c_str());
        Preferences prefs;
        prefs.begin("wifi", false);
        prefs.putString("ssid",     g_wifi_ssid);
        prefs.putString("password", g_wifi_password);
        prefs.end();
        configure_ntp();
        if (g_wifi_status_lbl) {
            char connected_msg[60];
            snprintf(connected_msg, sizeof(connected_msg), "Connected & saved\n%s",
                     WiFi.localIP().toString().c_str());
            lv_label_set_text(g_wifi_status_lbl, connected_msg);
        }
    } else {
        WiFi.disconnect(false);
        if (g_wifi_status_lbl) lv_label_set_text(g_wifi_status_lbl, "Connection failed - check credentials");
    }
}

static void close_wifi_scan_overlay() {
    if (g_wifi_scan_overlay) {
        lv_obj_delete(g_wifi_scan_overlay);
        g_wifi_scan_overlay = nullptr;
    }
}

// Full-screen dimmed overlay that hosts either the "scanning" spinner or the
// results panel; only one is ever alive at a time, tracked by g_wifi_scan_overlay.
static lv_obj_t *build_scan_overlay(lv_obj_t *scr) {
    lv_obj_t *overlay = lv_obj_create(scr);
    lv_obj_set_size(overlay, TFT_HOR_RES, TFT_VER_RES);
    lv_obj_set_pos(overlay, 0, 0);
    lv_obj_set_style_bg_color(overlay, C(0x000000), 0);
    lv_obj_set_style_bg_opa(overlay, LV_OPA_70, 0);
    lv_obj_set_style_border_width(overlay, 0, 0);
    lv_obj_set_style_radius(overlay, 0, 0);
    lv_obj_set_style_pad_all(overlay, 0, 0);
    lv_obj_remove_flag(overlay, LV_OBJ_FLAG_SCROLLABLE);
    g_wifi_scan_overlay = overlay;
    return overlay;
}

static void show_wifi_scan_results(lv_obj_t *scr, int16_t n) {
    close_wifi_scan_overlay();
    lv_obj_t *overlay = build_scan_overlay(scr);

