Piers-Walter/ESP32-4848S040/src/main.cpp
    lv_obj_t *scan_btn = lv_button_create(scr);
    lv_obj_set_pos(scan_btn, 20 + ssid_ta_w + 8, 86);
    lv_obj_set_size(scan_btn, 48, 48);
    lv_obj_set_style_bg_color(scan_btn, C(0x14181E), 0);
    lv_obj_set_style_bg_opa(scan_btn, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(scan_btn, C(0x2A3038), 0);
    lv_obj_set_style_border_width(scan_btn, 1, 0);
    lv_obj_set_style_radius(scan_btn, 8, 0);
    lv_obj_set_style_pad_all(scan_btn, 0, 0);
    lv_obj_t *scan_icon = lv_label_create(scan_btn);
    lv_label_set_text(scan_icon, FA_SEARCH_ICON);
    lv_obj_set_style_text_font(scan_icon, &lv_font_fa_extra_icons, 0);
    lv_obj_set_style_text_color(scan_icon, C(0x39B57C), 0);
    lv_obj_align(scan_icon, LV_ALIGN_CENTER, 0, 0);
    lv_obj_add_event_cb(scan_btn, [](lv_event_t *) {
        wifi_start_scan(lv_screen_active());
    }, LV_EVENT_CLICKED, nullptr);

    lv_obj_t *pwd_lbl = lv_label_create(scr);
    lv_label_set_text(pwd_lbl, "Password");
    lv_obj_set_style_text_color(pwd_lbl, C(0x6E7681), 0);
    lv_obj_set_style_text_font(pwd_lbl, &lv_font_montserrat_12, 0);
    lv_obj_set_pos(pwd_lbl, 20, 148);

    lv_obj_t *pwd_ta = lv_textarea_create(scr);
    lv_obj_set_pos(pwd_ta, 20, 166);
    lv_textarea_set_one_line(pwd_ta, true);
    lv_obj_set_size(pwd_ta, TFT_HOR_RES - 40, 48);
    lv_textarea_set_password_mode(pwd_ta, true);
    lv_textarea_set_placeholder_text(pwd_ta, "Enter password");
    lv_textarea_set_text(pwd_ta, g_wifi_password);
    lv_obj_set_style_bg_color(pwd_ta, C(0x14181E), 0);
    lv_obj_set_style_bg_opa(pwd_ta, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(pwd_ta, C(0x2A3038), 0);
    lv_obj_set_style_border_width(pwd_ta, 1, 0);
    lv_obj_set_style_border_color(pwd_ta, C(0x39B57C), LV_STATE_FOCUSED);
    lv_obj_set_style_radius(pwd_ta, 8, 0);
    lv_obj_set_style_text_color(pwd_ta, C(0xE6E8EB), 0);
    lv_obj_set_style_text_font(pwd_ta, &lv_font_montserrat_14, 0);
    lv_obj_set_style_pad_hor(pwd_ta, 12, 0);
    lv_obj_set_style_pad_ver(pwd_ta, 15, 0);

    lv_obj_t *save_btn = lv_button_create(scr);
    lv_obj_set_size(save_btn, TFT_HOR_RES - 40, 48);
    lv_obj_set_pos(save_btn, 20, 230);
    lv_obj_set_style_bg_color(save_btn, C(0x39B57C), 0);
    lv_obj_set_style_bg_opa(save_btn, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(save_btn, 0, 0);
    lv_obj_set_style_radius(save_btn, 10, 0);
    lv_obj_set_style_pad_all(save_btn, 0, 0);
    lv_obj_remove_flag(save_btn, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_t *save_lbl = lv_label_create(save_btn);
    lv_label_set_text(save_lbl, "Connect & Save");
    lv_obj_set_style_text_color(save_lbl, C(0xFFFFFF), 0);
    lv_obj_set_style_text_font(save_lbl, &lv_font_montserrat_16, 0);
    lv_obj_align(save_lbl, LV_ALIGN_CENTER, 0, 0);
    lv_obj_add_event_cb(save_btn, [](lv_event_t *) {
        wifi_connect_and_save();
    }, LV_EVENT_CLICKED, nullptr);

    lv_obj_t *status_lbl = lv_label_create(scr);
    char init_status[100] = "";
    if (WiFi.status() == WL_CONNECTED)
        snprintf(init_status, sizeof(init_status), "Connected to: %s\n%s",
                 WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());
    else if (strlen(g_wifi_ssid) > 0)
        snprintf(init_status, sizeof(init_status), "Saved: %s", g_wifi_ssid);
    lv_label_set_text(status_lbl, init_status);
    lv_obj_set_style_text_color(status_lbl, C(0x9AA3AD), 0);
    lv_obj_set_style_text_font(status_lbl, &lv_font_montserrat_12, 0);
    lv_obj_set_width(status_lbl, TFT_HOR_RES - 40);
    lv_obj_set_pos(status_lbl, 20, 288);
    lv_obj_set_style_text_align(status_lbl, LV_TEXT_ALIGN_CENTER, 0);
    g_wifi_status_lbl = status_lbl;

    lv_obj_t *kb = lv_keyboard_create(scr);
    lv_obj_set_size(kb, TFT_HOR_RES, 220);
    lv_obj_align(kb, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_obj_add_flag(kb, LV_OBJ_FLAG_HIDDEN);
    g_wifi_keyboard = kb;
    g_ssid_ta       = ssid_ta;
    g_pwd_ta        = pwd_ta;

    lv_obj_add_event_cb(ssid_ta, [](lv_event_t *) {
        if (g_wifi_keyboard) {
            lv_keyboard_set_textarea(g_wifi_keyboard, g_ssid_ta);
            lv_obj_remove_flag(g_wifi_keyboard, LV_OBJ_FLAG_HIDDEN);
        }
    }, LV_EVENT_FOCUSED, nullptr);

    lv_obj_add_event_cb(pwd_ta, [](lv_event_t *) {
        if (g_wifi_keyboard) {
            lv_keyboard_set_textarea(g_wifi_keyboard, g_pwd_ta);
            lv_obj_remove_flag(g_wifi_keyboard, LV_OBJ_FLAG_HIDDEN);
        }
    }, LV_EVENT_FOCUSED, nullptr);

    lv_obj_add_event_cb(kb, [](lv_event_t *e) {
        lv_event_code_t code = lv_event_get_code(e);
        if (code == LV_EVENT_READY || code == LV_EVENT_CANCEL)
            lv_obj_add_flag(g_wifi_keyboard, LV_OBJ_FLAG_HIDDEN);
    }, LV_EVENT_ALL, nullptr);
}

// ── About screen ──────────────────────────────────────────────────────────
static void build_about(lv_obj_t *scr) {
    lv_obj_t *hdr  = build_header(scr);
    lv_obj_t *bbtn = build_back_btn(hdr);
    lv_obj_add_event_cb(bbtn, back_to_settings, LV_EVENT_CLICKED, nullptr);

    lv_obj_t *tlbl = lv_label_create(hdr);
    lv_label_set_text(tlbl, "About");
    lv_obj_set_style_text_color(tlbl, C(0xE6E8EB), 0);
    lv_obj_set_style_text_font(tlbl, &lv_font_montserrat_16, 0);
    lv_obj_align(tlbl, LV_ALIGN_LEFT_MID, 44, 0);

    // Red roundel bar accent
    lv_obj_t *bar = lv_obj_create(scr);
    lv_obj_set_size(bar, 64, 6);
    lv_obj_set_style_bg_color(bar, C(0xE32017), 0);
    lv_obj_set_style_bg_opa(bar, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(bar, 0, 0);
    lv_obj_set_style_radius(bar, 3, 0);
    lv_obj_remove_flag(bar, (lv_obj_flag_t)(LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE));
    lv_obj_align(bar, LV_ALIGN_CENTER, 0, -60);

    lv_obj_t *app_lbl = lv_label_create(scr);
    lv_label_set_text(app_lbl, "TubeStatus");
    lv_obj_set_style_text_color(app_lbl, C(0xE6E8EB), 0);
    lv_obj_set_style_text_font(app_lbl, &lv_font_montserrat_22, 0);
    lv_obj_align(app_lbl, LV_ALIGN_CENTER, 0, -28);

    lv_obj_t *powered_lbl = lv_label_create(scr);
    lv_label_set_text(powered_lbl, "Powered by TfL Open Data");
    lv_obj_set_style_text_color(powered_lbl, C(0x9AA3AD), 0);
    lv_obj_set_style_text_font(powered_lbl, &lv_font_montserrat_14, 0);
    lv_obj_align(powered_lbl, LV_ALIGN_CENTER, 0, 10);

