Piers-Walter/ESP32-4848S040/src/main.cpp
}

// ── Settings menu screen ──────────────────────────────────────────────────
static void build_settings(lv_obj_t *scr) {
    lv_obj_t *hdr  = build_header(scr);
    lv_obj_t *bbtn = build_back_btn(hdr);
    lv_obj_add_event_cb(bbtn, back_to_home, LV_EVENT_CLICKED, nullptr);

    lv_obj_t *tlbl = lv_label_create(hdr);
    lv_label_set_text(tlbl, "Settings");
    lv_obj_set_style_text_color(tlbl, C(0xE6E8EB), 0);
    lv_obj_set_style_text_font(tlbl, &lv_font_montserrat_16, 0);
    lv_obj_align(tlbl, LV_ALIGN_LEFT_MID, 44, 0);

    struct MenuItem { const char *icon; const char *label; ScreenType target; };
    static const MenuItem items[] = {
        { LV_SYMBOL_LIST, "Lines", SCREEN_SETTINGS_LINES },
        { LV_SYMBOL_WIFI, "Wi-Fi", SCREEN_WIFI_CONFIG    },
        { FA_INFO_ICON, "About", SCREEN_ABOUT          },
    };

    for (int i = 0; i < 3; i++) {
        lv_obj_t *row = lv_button_create(scr);
        lv_obj_set_size(row, TFT_HOR_RES - 24, 64);
        lv_obj_set_pos(row, 12, 68 + i * 72);
        lv_obj_set_style_bg_color(row, C(0x14181E), 0);
        lv_obj_set_style_bg_opa(row, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(row, 0, 0);
        lv_obj_set_style_radius(row, 10, 0);
        lv_obj_set_style_pad_all(row, 0, 0);
        lv_obj_remove_flag(row, LV_OBJ_FLAG_SCROLLABLE);
        lv_obj_add_event_cb(row, [](lv_event_t *e) {
            navigate_to((ScreenType)(uintptr_t)lv_event_get_user_data(e));
        }, LV_EVENT_CLICKED, (void *)(uintptr_t)items[i].target);

        lv_obj_t *icon = lv_label_create(row);
        
        lv_label_set_text(icon, items[i].icon);
        lv_obj_set_style_text_color(icon, C(0x9AA3AD), 0);
        if(i==2){
            lv_obj_set_style_text_font(icon, &lv_font_fa_extra_icons, 0);
        }else{
            lv_obj_set_style_text_font(icon, &lv_font_montserrat_16, 0);
        }
        lv_obj_align(icon, LV_ALIGN_LEFT_MID, 16, 0);
        lv_obj_remove_flag(icon, LV_OBJ_FLAG_CLICKABLE);

        lv_obj_t *lbl = lv_label_create(row);
        lv_label_set_text(lbl, items[i].label);
        lv_obj_set_style_text_color(lbl, C(0xE6E8EB), 0);
        lv_obj_set_style_text_font(lbl, &lv_font_montserrat_16, 0);
        lv_obj_align(lbl, LV_ALIGN_LEFT_MID, 46, 0);
        lv_obj_remove_flag(lbl, LV_OBJ_FLAG_CLICKABLE);

        lv_obj_t *chev = lv_label_create(row);
        lv_label_set_text(chev, LV_SYMBOL_RIGHT);
        lv_obj_set_style_text_color(chev, C(0x3A4048), 0);
        lv_obj_set_style_text_font(chev, &lv_font_montserrat_16, 0);
        lv_obj_align(chev, LV_ALIGN_RIGHT_MID, -16, 0);
        lv_obj_remove_flag(chev, LV_OBJ_FLAG_CLICKABLE);
    }

    // Rotate-screen row: acts immediately on tap instead of navigating away.
    lv_obj_t *rot_row = lv_button_create(scr);
    lv_obj_set_size(rot_row, TFT_HOR_RES - 24, 64);
    lv_obj_set_pos(rot_row, 12, 68 + 3 * 72);
    lv_obj_set_style_bg_color(rot_row, C(0x14181E), 0);
    lv_obj_set_style_bg_opa(rot_row, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(rot_row, 0, 0);
    lv_obj_set_style_radius(rot_row, 10, 0);
    lv_obj_set_style_pad_all(rot_row, 0, 0);
    lv_obj_remove_flag(rot_row, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *rot_icon = lv_label_create(rot_row);
    lv_label_set_text(rot_icon, LV_SYMBOL_REFRESH);
    lv_obj_set_style_text_color(rot_icon, C(0x9AA3AD), 0);
    lv_obj_set_style_text_font(rot_icon, &lv_font_montserrat_16, 0);
    lv_obj_align(rot_icon, LV_ALIGN_LEFT_MID, 16, 0);
    lv_obj_remove_flag(rot_icon, LV_OBJ_FLAG_CLICKABLE);

    lv_obj_t *rot_lbl = lv_label_create(rot_row);
    lv_label_set_text(rot_lbl, "Rotate Screen");
    lv_obj_set_style_text_color(rot_lbl, C(0xE6E8EB), 0);
    lv_obj_set_style_text_font(rot_lbl, &lv_font_montserrat_16, 0);
    lv_obj_align(rot_lbl, LV_ALIGN_LEFT_MID, 46, 0);
    lv_obj_remove_flag(rot_lbl, LV_OBJ_FLAG_CLICKABLE);

    lv_obj_t *rot_deg = lv_label_create(rot_row);
    lv_label_set_text(rot_deg, SCREEN_ROTATION_LABELS[g_screen_rotation]);
    lv_obj_set_style_text_color(rot_deg, C(0x6E7681), 0);
    lv_obj_set_style_text_font(rot_deg, &lv_font_montserrat_16, 0);
    lv_obj_align(rot_deg, LV_ALIGN_RIGHT_MID, -16, 0);
    lv_obj_remove_flag(rot_deg, LV_OBJ_FLAG_CLICKABLE);

    lv_obj_add_event_cb(rot_row, [](lv_event_t *e) {
        apply_screen_rotation(g_screen_rotation + 1);
        save_screen_rotation();
        lv_label_set_text((lv_obj_t *)lv_event_get_user_data(e), SCREEN_ROTATION_LABELS[g_screen_rotation]);
    }, LV_EVENT_CLICKED, rot_deg);
}

// ── Navigation ───────────────────────────────────────────────────────────
static void delete_scr_async(void *param) {
    lv_obj_delete((lv_obj_t *)param);
}

static void navigate_to(ScreenType type, int line_idx) {
    g_current_screen  = type;
    g_time_lbl        = nullptr;
    g_wifi_icon_cont  = nullptr;
    memset(g_wifi_arcs, 0, sizeof(g_wifi_arcs));
    g_tile_cont       = nullptr;
    g_wifi_keyboard   = nullptr;
    g_ssid_ta         = nullptr;
    g_pwd_ta          = nullptr;
    g_wifi_status_lbl = nullptr;
    g_wifi_scan_overlay = nullptr;
    if (type != SCREEN_HOME) g_home_page = 0;

    lv_obj_t *old_scr = lv_screen_active();

    lv_obj_t *new_scr = lv_obj_create(nullptr);
    style_screen(new_scr);

    switch (type) {
        case SCREEN_HOME:           build_home(new_scr);             break;
        case SCREEN_DETAIL:         build_detail(new_scr, line_idx); break;
        case SCREEN_SETTINGS:       build_settings(new_scr);         break;
        case SCREEN_SETTINGS_LINES: build_settings_lines(new_scr);   break;
        case SCREEN_WIFI_CONFIG:    build_wifi_config(new_scr);      break;
        case SCREEN_ABOUT:          build_about(new_scr);            break;
    }

    lv_scr_load(new_scr);
    if (old_scr) lv_async_call(delete_scr_async, old_scr);
}

// ── TfL API ───────────────────────────────────────────────────────────────
// GET https://api.tfl.gov.uk/Line/Mode/tube,dlr,elizabeth-line,tram,overground/Status
// severity >= 10 → GOOD, 7–9 → MINOR, ≤ 6 → SEVERE
static void fetch_tfl_status() {
    // Reconnect if needed
    if (WiFi.status() != WL_CONNECTED) {
        if (strlen(g_wifi_ssid) == 0) return;
        Serial.println("[TfL] WiFi down, reconnecting...");
        WiFi.begin(g_wifi_ssid, g_wifi_password);
        uint32_t t = millis();
        while (WiFi.status() != WL_CONNECTED && millis() - t < 10000) {
            lv_timer_handler();
            delay(50);
        }
        if (WiFi.status() != WL_CONNECTED) {
            Serial.println("[TfL] Reconnect failed");
            return;
        }
        configure_ntp();
    }

    Serial.printf("[TfL] Fetching... free heap: %lu PSRAM: %lu\n",
        (unsigned long)ESP.getFreeHeap(), (unsigned long)ESP.getFreePsram());

    // Allocate response buffer from PSRAM (128 KB — TfL full-status response is ~50–100 KB)
    static const int BUF_SIZE = 131072;
    char *buf = (char *)ps_malloc(BUF_SIZE);
    if (!buf) {
        Serial.println("[TfL] PSRAM alloc failed for response buffer");
        return;
    }

    Serial.println("[TfL] Creating WiFiClientSecure...");
    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(15);  // seconds

    Serial.println("[TfL] Starting HTTP GET...");
    HTTPClient http;
    http.useHTTP10(true);  // HTTP/1.0: no chunked encoding, server closes connection when done
    http.begin(client, "https://api.tfl.gov.uk/Line/Mode/tube,dlr,elizabeth-line,tram,overground/Status");
    http.setTimeout(15000);
    http.addHeader("Accept", "application/json");

