Piers-Walter/ESP32-4848S040/src/main.cpp
    int code = http.GET();
    Serial.printf("[TfL] HTTP response code: %d\n", code);
    if (code != 200) {
        Serial.printf("[TfL] Error body: %s\n", http.getString().c_str());
        http.end();
        free(buf);
        return;
    }

    int content_len = http.getSize();
    Serial.printf("[TfL] Content-Length: %d  connected: %d\n", content_len, (int)http.connected());

    // getStreamPtr() gives raw stream; safe to use with HTTP/1.0 (no chunk headers).
    // Loop exits on TCP close (!connected) or 3 s idle after receiving data.
    WiFiClient *stream = http.getStreamPtr();
    int total = 0;
    uint32_t last_data_ms = millis();
    uint32_t deadline     = millis() + 30000;
    while (total < BUF_SIZE - 1 && millis() < deadline) {
        int avail = stream->available();
        if (avail > 0) {
            int n = stream->readBytes((uint8_t *)(buf + total),
                                      min(avail, BUF_SIZE - 1 - total));
            total += n;
            last_data_ms = millis();
        } else if (!http.connected()) {
            Serial.printf("[TfL] Connection closed after %d bytes\n", total);
            break;
        } else if (total > 0 && millis() - last_data_ms > 3000) {
            Serial.printf("[TfL] Idle 3s after %d bytes — treating as end\n", total);
            break;
        } else {
            delay(5);
        }
    }
    bool timed_out = (millis() >= deadline);
    buf[total] = '\0';
    http.end();
    client.stop();

    Serial.printf("[TfL] Read complete: %d bytes, timed_out=%d, free_heap=%lu\n",
        total, (int)timed_out, (unsigned long)ESP.getFreeHeap());
    if (total == 0) { free(buf); return; }

    // Print first 120 chars so we can confirm it's valid JSON
    Serial.printf("[TfL] Body start: %.120s\n", buf);

    Serial.println("[TfL] Parsing JSON...");
    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, buf, total);
    free(buf);

    Serial.printf("[TfL] Parse result: %s\n", err.c_str());
    if (err) return;

    int matched = 0;
    for (JsonObject line_obj : doc.as<JsonArray>()) {
        const char *id = line_obj["id"];
        if (!id) continue;
        for (int i = 0; i < NUM_LINES; i++) {
            if (strcmp(LINES[i].id, id) != 0) continue;
            JsonArray statuses = line_obj["lineStatuses"].as<JsonArray>();
            if (statuses.isNull() || statuses.size() == 0) break;
            JsonObject s0      = statuses[0];
            int         sev    = s0["statusSeverity"]            | 10;
            const char *desc   = s0["statusSeverityDescription"] | "Good service";
            const char *reason = s0["reason"]                    | "";

            line_statuses[i].level = (sev >= 10) ? STATUS_GOOD
                                   : (sev >= 7)  ? STATUS_MINOR
                                                 : STATUS_SEVERE;
            strncpy(line_statuses[i].headline, desc, 79);
            line_statuses[i].headline[79] = '\0';
            const char *det = (strlen(reason) > 0) ? reason : desc;
            strncpy(line_statuses[i].detail, det, 319);
            line_statuses[i].detail[319] = '\0';
            Serial.printf("[TfL]   %s → sev=%d %s\n", id, sev, desc);
            matched++;
            break;
        }
    }

    g_last_fetch_ms = millis();
    g_ever_fetched  = true;
    strncpy(g_last_fetch_time, clock_str().c_str(), 5);
    g_last_fetch_time[5] = '\0';
    Serial.printf("[TfL] Done: %d lines matched. Free heap: %lu\n",
        matched, (unsigned long)ESP.getFreeHeap());

    if (g_current_screen == SCREEN_HOME) navigate_to(SCREEN_HOME);
}

// ── Fetch timer ───────────────────────────────────────────────────────────
static bool g_fetch_requested = false;

static void fetch_timer_cb(lv_timer_t *) {
    g_fetch_requested = true;
}

// ── LVGL platform callbacks ───────────────────────────────────────────────
static void my_disp_flush(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
    uint32_t w = area->x2 - area->x1 + 1;
    uint32_t h = area->y2 - area->y1 + 1;
    gfx->draw16bitRGBBitmap(area->x1, area->y1, (uint16_t *)px_map, w, h);
    lv_disp_flush_ready(disp);
}

static void my_touchpad_read(lv_indev_t *, lv_indev_data_t *data) {
    if (touch_has_signal()) {
        if (touch_touched()) {
            data->state   = LV_INDEV_STATE_PRESSED;
            data->point.x = touch_last_x;
            data->point.y = touch_last_y;
        } else if (touch_released()) {
            data->state = LV_INDEV_STATE_RELEASED;
        }
    } else {
        data->state = LV_INDEV_STATE_RELEASED;
    }
}

static uint32_t my_tick() { return millis(); }

// ── Clock timer ───────────────────────────────────────────────────────────
static void clock_cb(lv_timer_t *) {
    if (g_time_lbl) lv_label_set_text(g_time_lbl, clock_str().c_str());
    update_wifi_icon();
}

// ── Screenshot server ─────────────────────────────────────────────────────
#ifdef SCREENSHOT_SERVER
static void screenshot_handler() {
    // lv_snapshot_take allocates via LVGL's heap (128 KB) — too small for 480×480 RGB565 (~460 KB).
    // Pre-allocate from PSRAM and use lv_snapshot_take_to_draw_buf instead.
    const uint32_t buf_size = (uint32_t)TFT_HOR_RES * TFT_VER_RES * 2;
    uint8_t *pixel_buf = (uint8_t *)ps_malloc(buf_size);
    if (!pixel_buf) {
        g_screenshot_server.send(503, "text/plain", "PSRAM alloc failed");
        return;
    }

    lv_draw_buf_t draw_buf;
    lv_draw_buf_init(&draw_buf, TFT_HOR_RES, TFT_VER_RES, LV_COLOR_FORMAT_RGB565,
                     LV_STRIDE_AUTO, pixel_buf, buf_size);

    if (lv_snapshot_take_to_draw_buf(lv_screen_active(), LV_COLOR_FORMAT_RGB565, &draw_buf) != LV_RESULT_OK) {
        free(pixel_buf);
        g_screenshot_server.send(503, "text/plain", "Snapshot failed");
        return;
    }

    const uint32_t stride     = draw_buf.header.stride;  // may include alignment padding
    const uint32_t pixel_data_size = (uint32_t)TFT_HOR_RES * TFT_VER_RES * 3;
    const uint32_t file_size  = 54 + pixel_data_size;

    // BMP file header (14 b) + BITMAPINFOHEADER (40 b)
    uint8_t hdr[54] = {};
    hdr[0] = 'B'; hdr[1] = 'M';
    memcpy(hdr + 2,  &file_size,            4);
    const uint32_t pix_offset = 54;
    memcpy(hdr + 10, &pix_offset,           4);
    const uint32_t dib_size = 40;
    memcpy(hdr + 14, &dib_size,             4);
    const int32_t bw = TFT_HOR_RES, bh = TFT_VER_RES;
    memcpy(hdr + 18, &bw, 4);
    memcpy(hdr + 22, &bh, 4);  // positive height = bottom-up row order
    hdr[26] = 1;   // colour planes
    hdr[28] = 24;  // bits per pixel (RGB888)

    WiFiClient client = g_screenshot_server.client();
    client.printf("HTTP/1.1 200 OK\r\nContent-Type: image/bmp\r\nContent-Length: %u\r\nConnection: close\r\n\r\n",
                  (unsigned)file_size);
    client.write(hdr, sizeof(hdr));

