Piers-Walter/ESP32-4848S040/src/main.cpp
    // Convert RGB565 → BGR888 row by row, bottom-to-top (BMP convention)
    uint8_t row_buf[TFT_HOR_RES * 3];
    for (int y = TFT_VER_RES - 1; y >= 0; y--) {
        const uint16_t *row = reinterpret_cast<const uint16_t *>(pixel_buf + y * stride);
        for (int x = 0; x < TFT_HOR_RES; x++) {
            uint16_t p = row[x];
            uint8_t r = (p >> 11) & 0x1F; r = (r << 3) | (r >> 2);
            uint8_t g = (p >>  5) & 0x3F; g = (g << 2) | (g >> 4);
            uint8_t b =  p        & 0x1F; b = (b << 3) | (b >> 2);
            row_buf[x * 3]     = b;
            row_buf[x * 3 + 1] = g;
            row_buf[x * 3 + 2] = r;
        }
        client.write(row_buf, sizeof(row_buf));
    }

    free(pixel_buf);
    client.stop();
}

static void screenshot_server_begin() {
    g_screenshot_server.on("/screenshot", HTTP_GET, screenshot_handler);
    g_screenshot_server.begin();
    Serial.printf("[Screenshot] http://%s/screenshot\n", WiFi.localIP().toString().c_str());
}
#endif  // SCREENSHOT_SERVER

// ── setup / loop ─────────────────────────────────────────────────────────
void setup() {
    Serial.begin(115200);

    // Allocate draw buffer from PSRAM before WiFi/LVGL claim internal heap
    draw_buf = (uint8_t *)ps_malloc(DRAW_BUF_SIZE);
    if (!draw_buf) {
        Serial.println("[WARN] PSRAM alloc failed, falling back to DRAM for draw_buf");
        draw_buf = (uint8_t *)malloc(DRAW_BUF_SIZE);
    }

    // Allocate status array from PSRAM (20 × ~400 bytes = ~8 KB)
    line_statuses = (StatusInfo *)ps_calloc(NUM_LINES, sizeof(StatusInfo));
    if (!line_statuses) {
        Serial.println("[WARN] PSRAM alloc failed for line_statuses, using DRAM");
        line_statuses = (StatusInfo *)calloc(NUM_LINES, sizeof(StatusInfo));
    }

    Serial.printf("[Mem] Free heap: %lu  Free PSRAM: %lu\n",
        (unsigned long)ESP.getFreeHeap(), (unsigned long)ESP.getFreePsram());

    // Init WiFi early so it can claim internal DRAM before LVGL buffers
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(false);

    touch_init();

    bus = new Arduino_ESP32SPI(
        GFX_NOT_DEFINED, 39, 48, 47, GFX_NOT_DEFINED);

    Arduino_ESP32RGBPanel *rgbpanel = new Arduino_ESP32RGBPanel(
        18, 17, 16, 21,
        11, 12, 13, 14, 0,
        8, 20, 3, 46, 9, 10,
        4, 5, 6, 7, 15,
        1, 10, 8, 50,
        1, 10, 8, 20,
        0, GFX_NOT_DEFINED, false, 0, 0, TFT_HOR_RES * 10);

    gfx = new Arduino_RGB_Display(
        480, 480, rgbpanel, 0, true,
        bus, GFX_NOT_DEFINED,
        st7701_4848s040_init_operations, sizeof(st7701_4848s040_init_operations));

    if (!gfx->begin()) Serial.println("gfx->begin() failed!");

    pinMode(GFX_BL, OUTPUT);
    analogWrite(GFX_BL, TFT_BRIGHTNESS);
    gfx->fillScreen(RGB565_BLACK);
    gfx->setRotation(3);

    lv_init();
    lv_tick_set_cb(my_tick);

    g_disp = lv_display_create(TFT_HOR_RES, TFT_VER_RES);
    lv_display_set_flush_cb(g_disp, my_disp_flush);
    lv_display_set_buffers(g_disp, draw_buf, nullptr, DRAW_BUF_SIZE, LV_DISPLAY_RENDER_MODE_PARTIAL);
    load_screen_rotation();
    apply_screen_rotation(g_screen_rotation);

    lv_indev_t *indev = lv_indev_create();
    lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
    lv_indev_set_read_cb(indev, my_touchpad_read);

    // App init
    for (int i = 0; i < NUM_LINES; i++) {
        line_enabled[i] = true;  // default; overwritten by load_line_prefs() below
        // Default status until first fetch
        line_statuses[i].level = STATUS_GOOD;
        strncpy(line_statuses[i].headline, "Loading...", 79);
        strncpy(line_statuses[i].detail,   "Fetching status from TfL...", 319);
        // Build uppercase display name
        const char *src = LINES[i].short_name ? LINES[i].short_name : LINES[i].name;
        int j = 0;
        for (; src[j] && j < 19; j++)
            disp_names[i][j] = (src[j] >= 'a' && src[j] <= 'z') ? src[j] - 32 : src[j];
        disp_names[i][j] = '\0';
    }

    lv_timer_create(clock_cb, 1000, nullptr);

    load_line_prefs();

    // Load saved WiFi credentials and start background connect
    load_wifi_credentials();
    if (strlen(g_wifi_ssid) > 0) {
        WiFi.begin(g_wifi_ssid, g_wifi_password);
        Serial.printf("[WiFi] Background connect to '%s'\n", g_wifi_ssid);
    }

    navigate_to(SCREEN_HOME);

    // Recurring fetch every 30 s; first fetch is triggered in loop() on WiFi connect
    lv_timer_create(fetch_timer_cb, 30000, nullptr);
}

void loop() {
    if (!g_wifi_was_connected && WiFi.status() == WL_CONNECTED) {
        g_wifi_was_connected = true;
        Serial.printf("[WiFi] Connected — IP: %s\n", WiFi.localIP().toString().c_str());
        configure_ntp();
        g_fetch_requested = true;
#ifdef SCREENSHOT_SERVER
        screenshot_server_begin();
#endif
    }
    if (g_fetch_requested) {
        g_fetch_requested = false;
        fetch_tfl_status();
    }
#ifdef SCREENSHOT_SERVER
    g_screenshot_server.handleClient();
#endif
    lv_timer_handler();
}
